## Plan Result (sbox-shutter)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;darts-portal&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;darts-portal&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;darts-portal&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;darts-portal&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["darts-portal"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-darts-portal-shutter-sbox"
      + origin_host_header            = "hmctsdartsporshuttersbox.z33.web.core.windows.net"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-darts-portal"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "sds-platform-sbox-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + origin {
          + host_name  = "hmctsdartsporshuttersbox.z33.web.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "hmctsdartsporshuttersbox-z33-web-core-windows-net"
        }
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["darts-portal"] will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "this" {
      + cdn_endpoint_id = (known after apply)
      + host_name       = "darts-portal.sandbox.platform.hmcts.net"
      + id              = (known after apply)
      + name            = "darts-portal-sandbox-platform-hmcts-net"
    }

  # module.shutter.azurerm_cdn_profile.main["darts-portal"] will be created
  + resource "azurerm_cdn_profile" "main" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "hmcts-shutter-darts-portal"
      + resource_group_name = "sds-platform-sbox-rg"
      + sku                 = "Standard_Verizon"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["darts-portal"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "beb3336ae240427182a6bbfe63ebbde5"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":423,"Program":"tfcmt","SHA1":"","Target":"sbox-shutter","Vars":{}} -->